sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
/*!
    \file    gd32a7xx_stcm.h
    \brief   definitions for the STCM
    
    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_STCM_H
#define GD32A7XX_STCM_H

#include "gd32a7xx.h"

/* STCM definitions */
#define STCM                          STCM_BASE                     /*!< STCM base address */

/* registers definitions */
#define STCM_TMRCS                    REG32((STCM) + 0x00000000U)   /*!< TMR control and status register */
#define STCM_BRCS                     REG32((STCM) + 0x00000004U)   /*!< BIST running control and status register */
#define STCM_WPK                      REG32((STCM) + 0x00000008U)   /*!< write protection key register */
#define STCM_CFG0                     REG32((STCM) + 0x0000000CU)   /*!< configuration register 0 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_CFG1                     REG32((STCM) + 0x00000010U)   /*!< configuration register 1 */
#define STCM_LBWDGT                   REG32((STCM) + 0x00000014U)   /*!< LBIST watchdog timer register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_MBWDGT                   REG32((STCM) + 0x00000018U)   /*!< MBIST watchdog timer register */
#define STCM_BESTAT0                  REG32((STCM) + 0x0000001CU)   /*!< BIST error state register 0 */
#define STCM_BESTAT1                  REG32((STCM) + 0x00000020U)   /*!< BIST error state register 1 */
#define STCM_BEM                      REG32((STCM) + 0x00000024U)   /*!< BIST error mapping register */
#define STCM_BINTVL                   REG32((STCM) + 0x00000028U)   /*!< BIST interval register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_LBCNTSTRAP               REG32((STCM) + 0x00000030U)   /*!< LBIST count timeout strap register */
#define STCM_LBPSTAT                  REG32((STCM) + 0x00000034U)   /*!< LBIST phase state register */
#define STCM_LBPE_STAT                REG32((STCM) + 0x00000038U)   /*!< LBIST phase end state register */
#define STCM_LBPEM                    REG32((STCM) + 0x0000003CU)   /*!< LBIST phase error mapping register */
#define STCM_LBPEINF                  REG32((STCM) + 0x00000040U)   /*!< LBIST phase error information register */
#define STCM_LBAITINTVL               REG32((STCM) + 0x00000044U)   /*!< LBIST AIT interval register */
#define STCM_LBPSCC                   REG32((STCM) + 0x00000048U)   /*!< LBIST peripheral shift clock control register */
#define STCM_LBPCFG                   REG32((STCM) + 0x00000060U)   /*!< LBIST phase configuration */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_MBALGSEL                 REG32((STCM) + 0x00000080U)   /*!< MBIST algorithm selection register */
#define STCM_MBPSTAT                  REG32((STCM) + 0x00000084U)   /*!< MBIST phase state register */
#define STCM_MBPE_STAT                REG32((STCM) + 0x00000088U)   /*!< MBIST phase end state register */
#define STCM_MBPEM                    REG32((STCM) + 0x0000008CU)   /*!< MBIST phase error mapping register */
#define STCM_MBLAUNCH                 REG32((STCM) + 0x00000090U)   /*!< MBIST phase launch register */
#define STCM_MB0PCFG                  REG32((STCM) + 0x000000A0U)   /*!< MBIST0 phase configuration register */
#define STCM_MB1PCFG                  REG32((STCM) + 0x000000A4U)   /*!< MBIST1 phase configuration register */
#define STCM_MB2PCFG                  REG32((STCM) + 0x000000A8U)   /*!< MBIST2 phase configuration register */
#define STCM_MB3PCFG                  REG32((STCM) + 0x000000ACU)   /*!< MBIST3 phase configuration register */
#define STCM_MB4PCFG                  REG32((STCM) + 0x000000B0U)   /*!< MBIST4 phase configuration register */
#define STCM_MB5PCFG                  REG32((STCM) + 0x000000B4U)   /*!< MBIST5 phase configuration register */
#define STCM_MB6PCFG                  REG32((STCM) + 0x000000B8U)   /*!< MBIST6 phase configuration register */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_MB7PCFG                  REG32((STCM) + 0x000000BCU)   /*!< MBIST7 phase configuration register */
#define STCM_MB8PCFG                  REG32((STCM) + 0x000000C0U)   /*!< MBIST8 phase configuration register */
#define STCM_MB9PCFG                  REG32((STCM) + 0x000000C4U)   /*!< MBIST9 phase configuration register */
#define STCM_MB10PCFG                 REG32((STCM) + 0x000000C8U)   /*!< MBIST10 phase configuration register */
#define STCM_MB11PCFG                 REG32((STCM) + 0x000000CCU)   /*!< MBIST11 phase configuration register */
#define STCM_MB12PCFG                 REG32((STCM) + 0x000000D0U)   /*!< MBIST12 phase configuration register */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_MBPCFG(mbistx)           REG32((STCM) + 0x000000A0U + (mbistx) * 0x4U)      /*!< MBISTx phase configuration register */

