sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
/* bits definitions */
/* STCM_TMRCS */
#define STCM_TMRCS_TMR_RUNBP_EN       BIT(0)                        /*!< TMR(Triple-Modular Redundancy) run BIST phase enable */
#define STCM_TMRCS_TMR_RUNBP          BIT(1)                        /*!< TMR(Triple-Modular Redundancy) state of run BIST phase */

/* STCM_BRCS */
#define STCM_BRCS_RUNBP               BIT(0)                        /*!< run BIST phase */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BRCS_LBEPLLEN            BIT(8)                        /*!< LBIST executed with PLL enabled */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define STCM_BRCS_MBEPLLEN            BIT(9)                        /*!< MBIST executed with PLL enabled */

/* STCM_WPK */
#define STCM_WPK_WPK                  BITS(0,31)                    /*!< STCM write protection key */

/* STCM_CFG0 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_CFG0_REF_DIV             BITS(0,2)                     /*!< reference clock divider */
#define STCM_CFG0_AOSEL               BIT(4)                        /*!< RAM or ROM selection */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_CFG0_WAP                 BIT(8)                        /*!< write access protection */
#define STCM_CFG0_MBWDG_DIV           BITS(16,18)                   /*!< MBIST watchdog clock divider */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_CFG0_LBWDG_DIV           BITS(20,22)                   /*!< LBIST watchdog clock divider */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_CFG0_FBPTR               BITS(25,30)                   /*!< first BIST pointer */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* STCM_CFG1 */
#define STCM_CFG1_LBAITPN             BITS(0,5)                     /*!< the AIT packet number of executing LBIST during phase */
#define STCM_CFG1_LBAITPADDR          BITS(21,31)                   /*!< the first AIT packet address of executing LBIST during phase */

/* STCM_LBWDGT */
#define STCM_LBWDGT_LBWDGT            BITS(0,31)                    /*!< LBIST watchdog timer */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* STCM_MBWDGT  */
#define STCM_MBWDGT_MBWDGT            BITS(0,31)                    /*!< MBIST watchdog timer */

/* STCM_BESTAT0 */
#define STCM_BESTAT0_PLLULK           BIT(0)                        /*!< PLL unlock error state */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BESTAT0_LBWDG            BIT(1)                        /*!< LBIST watchdog error state */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_BESTAT0_INVPTR           BIT(2)                        /*!< invalid LBIST pointer error state */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BESTAT0_BPSEL            BIT(3)                        /*!< BIST phase select error state */
#define STCM_BESTAT0_INVAITPADDR      BIT(4)                        /*!< invalid AIT packet address error state */
#define STCM_BESTAT0_MBWDG12          BIT(18)                       /*!< MBIST partition 12 watchdog error state */
#define STCM_BESTAT0_MBWDG11          BIT(19)                       /*!< MBIST partition 11 watchdog error state */
#define STCM_BESTAT0_MBWDG10          BIT(20)                       /*!< MBIST partition 10 watchdog error state */
#define STCM_BESTAT0_MBWDG9           BIT(21)                       /*!< MBIST partition 9 watchdog error state */
#define STCM_BESTAT0_MBWDG8           BIT(22)                       /*!< MBIST partition 8 watchdog error state */
#define STCM_BESTAT0_MBWDG7           BIT(23)                       /*!< MBIST partition 7 watchdog error state */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_BESTAT0_MBWDG6           BIT(24)                       /*!< MBIST partition 6 watchdog error state */
#define STCM_BESTAT0_MBWDG5           BIT(25)                       /*!< MBIST partition 5 watchdog error state */
#define STCM_BESTAT0_MBWDG4           BIT(26)                       /*!< MBIST partition 4 watchdog error state */
#define STCM_BESTAT0_MBWDG3           BIT(27)                       /*!< MBIST partition 3 watchdog error state */
#define STCM_BESTAT0_MBWDG2           BIT(28)                       /*!< MBIST partition 2 watchdog error state */
#define STCM_BESTAT0_MBWDG1           BIT(29)                       /*!< MBIST partition 1 watchdog error state */
#define STCM_BESTAT0_MBWDG0           BIT(30)                       /*!< MBIST partition 0 watchdog error state */
#define STCM_BESTAT0_MBWDGEG          BIT(31)                       /*!< MBIST watchdog global error state */

/* STCM_BESTAT1 */
#define STCM_BESTAT1_SP0              BIT(0)                        /*!< SMART protocol error state 0 */
#define STCM_BESTAT1_SP1              BIT(1)                        /*!< SMART protocol error state 1 */
#define STCM_BESTAT1_SP2              BIT(2)                        /*!< SMART protocol error state 2 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BESTAT1_AITP0            BIT(4)                        /*!< AIT protocol error state 0 */
#define STCM_BESTAT1_AITP1            BIT(5)                        /*!< AIT protocol error state 1 */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_BESTAT1_RES              BIT(30)                       /*!< recoverable error state */
#define STCM_BESTAT1_UES              BIT(31)                       /*!< unrecoverable error state */

/* STCM_BEM */
#define STCM_BEM_PLLUNLK              BIT(0)                        /*!< PLL unlock unrecoverable error mapping */
#define STCM_BEM_MBWDG                BIT(1)                        /*!< MBIST watchdog unrecoverable error mapping */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BEM_LBWDG                BIT(2)                        /*!< LBIST watchdog unrecoverable error mapping */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_BEM_ENG                  BIT(3)                        /*!< Engine unrecoverable error mapping */
#define STCM_BEM_INVPTR               BIT(4)                        /*!< invalid pointer unrecoverable error mapping */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BEM_BPSEL                BIT(5)                        /*!< BIST partition selection unrecoverable error mapping */
#define STCM_BEM_INVAITADDR           BIT(6)                        /*!< invalid AIT address unrecoverable error mapping */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

