sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
/* STCM_BINTVL */
#define STCM_BINTVL_INTVL             BITS(0,31)                    /*!< BIST phase interval */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* STCM_LBCNTSTRAP */
#define STCM_LBCNTSTRAP_LB_CNT_STRAP  BITS(0,7)                     /*!< LBIST timeout count strap */

/* STCM_LBPSTAT */
#define STCM_LBPSTAT_LBP              BITS(0,1)                     /*!< LBIST phase state */

/* STCM_LBPE_STAT */
#define STCM_LBPE_STAT_LBPEF          BITS(0,1)                     /*!< LBIST phase end flag */

/* STCM_LBPEM */
#define STCM_LBPEM_LBP                BIT(0)                        /*!< LBIST phase unreconverable error mapping */

/* STCM_LBPEINF */
#define STCM_LBPEINF_AIT_STAT         BITS(0,3)                     /*!< these bits stored the state of AIT when LBIST execution result is failed or timeout */
#define STCM_LBPEINF_LBPEADDR         BITS(16,26)                   /*!< LBIST phase0 error address */

/* STCM_BINTVL */
#define STCM_LBAITINTVL_INTVL         BITS(0,31)                    /*!< LBIST AIT packet interval */

/* STCM_LBPSCC */
#define STCM_LBPSCC_PSCC_STEP         BITS(4,6)                     /*!< peripheral shift clock control step size */
#define STCM_LBPSCC_PSCC_SEN          BIT(7)                        /*!< peripheral shift clock control start enable */
#define STCM_LBPSCC_PSCC_EEN          BIT(8)                        /*!< peripheral shift clock control end enable */

/* STCM_LBPCFG */
#define STCM_LBPCFG_SHR               BITS(13,15)                   /*!< shift rate */
#define STCM_LBPCFG_NXTPTR            BITS(25,30)                   /*!< next LBIST or MBIST pointer */
#define STCM_LBPCFG_SPM               BIT(31)                       /*!< serial or parallel mode */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* STCM_MBALGSEL */
#define STCM_MBALGSEL_MBALG0          BIT(0)                        /*!< MBIST algorithm 0 selection */
#define STCM_MBALGSEL_MBALG1          BIT(1)                        /*!< MBIST algorithm 1 selection */
#define STCM_MBALGSEL_MBALG2          BIT(2)                        /*!< MBIST algorithm 2 selection */
#define STCM_MBALGSEL_MBALG3          BIT(3)                        /*!< MBIST algorithm 3 selection */
#define STCM_MBALGSEL_MBALG4          BIT(4)                        /*!< MBIST algorithm 4 selection */
#define STCM_MBALGSEL_MBALG5          BIT(5)                        /*!< MBIST algorithm 5 selection */
#define STCM_MBALGSEL_MBALG6          BIT(6)                        /*!< MBIST algorithm 6 selection */
#define STCM_MBALGSEL_MBALG7          BIT(7)                        /*!< MBIST algorithm 7 selection */
#define STCM_MBALGSEL_MBALG8          BIT(8)                        /*!< MBIST algorithm 8 selection */
#define STCM_MBALGSEL_MBALG9          BIT(9)                        /*!< MBIST algorithm 9 selection */
#define STCM_MBALGSEL_MBALG10         BIT(10)                       /*!< MBIST algorithm 10 selection */
#define STCM_MBALGSEL_MBALG11         BIT(11)                       /*!< MBIST algorithm 11 selection */
#define STCM_MBALGSEL_MBALG12         BIT(12)                       /*!< MBIST algorithm 12 selection */
#define STCM_MBALGSEL_MBALG13         BIT(13)                       /*!< MBIST algorithm 13 selection */

/* STCM_MBPSTAT */
#define STCM_MBPSTAT_MBP0             BITS(0,1)                     /*!< MBIST partition 0 state */
#define STCM_MBPSTAT_MBP1             BITS(2,3)                     /*!< MBIST partition 1 state */
#define STCM_MBPSTAT_MBP2             BITS(4,5)                     /*!< MBIST partition 2 state */
#define STCM_MBPSTAT_MBP3             BITS(6,7)                     /*!< MBIST partition 3 state */
#define STCM_MBPSTAT_MBP4             BITS(8,9)                     /*!< MBIST partition 4 state */
#define STCM_MBPSTAT_MBP5             BITS(10,11)                   /*!< MBIST partition 5 state */
#define STCM_MBPSTAT_MBP6             BITS(12,13)                   /*!< MBIST partition 6 state */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_MBPSTAT_MBP7             BITS(14,15)                   /*!< MBIST partition 7 state */
#define STCM_MBPSTAT_MBP8             BITS(16,17)                   /*!< MBIST partition 8 state */
#define STCM_MBPSTAT_MBP9             BITS(18,19)                   /*!< MBIST partition 9 state */
#define STCM_MBPSTAT_MBP10            BITS(20,21)                   /*!< MBIST partition 10 state */
#define STCM_MBPSTAT_MBP11            BITS(22,23)                   /*!< MBIST partition 11 state */
#define STCM_MBPSTAT_MBP12            BITS(24,25)                   /*!< MBIST partition 12 state */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* STCM_MBPE_STAT */
#define STCM_MBPE_STAT_MBP0EF         BITS(0,1)                     /*!< MBIST partition 0 end flag */
#define STCM_MBPE_STAT_MBP1EF         BITS(2,3)                     /*!< MBIST partition 1 end flag */
#define STCM_MBPE_STAT_MBP2EF         BITS(4,5)                     /*!< MBIST partition 2 end flag */
#define STCM_MBPE_STAT_MBP3EF         BITS(6,7)                     /*!< MBIST partition 3 end flag */
#define STCM_MBPE_STAT_MBP4EF         BITS(8,9)                     /*!< MBIST partition 4 end flag */
#define STCM_MBPE_STAT_MBP5EF         BITS(10,11)                   /*!< MBIST partition 5 end flag */
#define STCM_MBPE_STAT_MBP6EF         BITS(12,13)                   /*!< MBIST partition 6 end flag */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_MBPE_STAT_MBP7EF         BITS(14,15)                   /*!< MBIST partition 7 end flag */
#define STCM_MBPE_STAT_MBP8EF         BITS(16,17)                   /*!< MBIST partition 8 end flag */
#define STCM_MBPE_STAT_MBP9EF         BITS(18,19)                   /*!< MBIST partition 9 end flag */
#define STCM_MBPE_STAT_MBP10EF        BITS(20,21)                   /*!< MBIST partition 10 end flag */
#define STCM_MBPE_STAT_MBP11EF        BITS(22,23)                   /*!< MBIST partition 11 end flag */
#define STCM_MBPE_STAT_MBP12EF        BITS(24,25)                   /*!< MBIST partition 12 end flag */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

