sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
/* STCM_MBPEM */
#define STCM_MBPEM_MBP0               BIT(0)                        /*!< MBIST partition 0 unrecoverable error mapping */
#define STCM_MBPEM_MBP1               BIT(1)                        /*!< MBIST partition 1 unrecoverable error mapping */
#define STCM_MBPEM_MBP2               BIT(2)                        /*!< MBIST partition 2 unrecoverable error mapping */
#define STCM_MBPEM_MBP3               BIT(3)                        /*!< MBIST partition 3 unrecoverable error mapping */
#define STCM_MBPEM_MBP4               BIT(4)                        /*!< MBIST partition 4 unrecoverable error mapping */
#define STCM_MBPEM_MBP5               BIT(5)                        /*!< MBIST partition 5 unrecoverable error mapping */
#define STCM_MBPEM_MBP6               BIT(6)                        /*!< MBIST partition 6 unrecoverable error mapping */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_MBPEM_MBP7               BIT(7)                        /*!< MBIST partition 7 unrecoverable error mapping */
#define STCM_MBPEM_MBP8               BIT(8)                        /*!< MBIST partition 8 unrecoverable error mapping */
#define STCM_MBPEM_MBP9               BIT(9)                        /*!< MBIST partition 9 unrecoverable error mapping */
#define STCM_MBPEM_MBP10              BIT(10)                       /*!< MBIST partition 10 unrecoverable error mapping */
#define STCM_MBPEM_MBP11              BIT(11)                       /*!< MBIST partition 11 unrecoverable error mapping */
#define STCM_MBPEM_MBP12              BIT(12)                       /*!< MBIST partition 12 unrecoverable error mapping */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* STCM_MBLAUNCH */
#define STCM_MBLAUNCH_MBLAUNCH        BITS(0,2)                     /*!< MBIST launch configuration */

/* STCM_MBxPCFG */
#define STCM_MBXPCFG_MBEN             BIT(0)                        /*!< MBIST partition x(x = 0~12) execute enable */
#define STCM_MBXPCFG_FAST_MOD         BIT(1)                        /*!< MBIST partition x(x = 0~12) executed in fast mode */
#define STCM_MBXPCFG_NXTPTR           BITS(25,30)                   /*!< next LBIST or MBIST pointer */
#define STCM_MBXPCFG_SPM              BIT(31)                       /*!< serial or parallel mode */

/* constants definitions */
typedef enum {
    STCM_NOTCOMPLETE     = 0U,                                      /*!< BIST execution not yet completed */
    STCM_FAILED          = 1U,                                      /*!< BIST execution failed */
    STCM_SUCCESSFUL      = 2U,                                      /*!< BIST execution successful  */
    STCM_ENDERROR        = 3U,                                      /*!< BIST execution end error */
    STCM_RESULTERROR     = 4U                                       /*!< BIST execution result error */
} stcm_bist_state;

/* TMR state */
typedef enum {
    STCM_TMR_NORMAL      = 0U,                                      /*!< TMR(Triple-Modular Redundancy) run BIST phase normal state */
    STCM_TMR_ERR         = 1U                                       /*!< TMR(Triple-Modular Redundancy) run BIST phase error state */
} stcm_tmr_state;

/* STCM error code */
typedef enum {
    BESTAT0_PLLULK          =    0U  << 1U | 0U,                    /*!< PLLULK error extract code*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    BESTAT0_LBWDG           =    1U  << 1U | 0U,                    /*!< LBWDG error extract code*/
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    BESTAT0_INVPTR          =    2U  << 1U | 0U,                    /*!< INVPTR error extract code*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    BESTAT0_BPSEL           =    3U  << 1U | 0U,                    /*!< BPSEL error extract code*/
    BESTAT0_INVAITPADDR     =    4U  << 1U | 0U,                    /*!< INVAITPADDR error extract code*/
    BESTAT0_MBWDG12         =    18U << 1U | 0U,                    /*!< MBWDG12 error extract code*/
    BESTAT0_MBWDG11         =    19U << 1U | 0U,                    /*!< MBWDG11 error extract code*/
    BESTAT0_MBWDG10         =    20U << 1U | 0U,                    /*!< MBWDG10 error extract code*/
    BESTAT0_MBWDG9          =    21U << 1U | 0U,                    /*!< MBWDG9 error extract code*/
    BESTAT0_MBWDG8          =    22U << 1U | 0U,                    /*!< MBWDG8 error extract code*/
    BESTAT0_MBWDG7          =    23U << 1U | 0U,                    /*!< MBWDG7 error extract code*/
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    BESTAT0_MBWDG6          =    24U << 1U | 0U,                    /*!< MBWDG6 error extract code*/
    BESTAT0_MBWDG5          =    25U << 1U | 0U,                    /*!< MBWDG5 error extract code*/
    BESTAT0_MBWDG4          =    26U << 1U | 0U,                    /*!< MBWDG4 error extract code*/
    BESTAT0_MBWDG3          =    27U << 1U | 0U,                    /*!< MBWDG3 error extract code*/
    BESTAT0_MBWDG2          =    28U << 1U | 0U,                    /*!< MBWDG2 error extract code*/
    BESTAT0_MBWDG1          =    29U << 1U | 0U,                    /*!< MBWDG1 error extract code*/
    BESTAT0_MBWDG0          =    30U << 1U | 0U,                    /*!< MBWDG0 error extract code*/
    BESTAT0_MBWDGEG         =    31U << 1U | 0U,                    /*!< MBWDGEG error extract code*/
    BESTAT1_SP0             =    0U  << 1U | 1U,                    /*!< SP0 error extract code*/
    BESTAT1_SP1             =    1U  << 1U | 1U,                    /*!< SP1 error extract code*/
    BESTAT1_SP2             =    2U  << 1U | 1U,                    /*!< SP2 error extract code*/
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    BESTAT1_AITP0           =    4U  << 1U | 1U,                    /*!< AITP0 error extract code*/
    BESTAT1_AITP1           =    5U  << 1U | 1U,                    /*!< AITP1 error extract code*/
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    BESTAT1_RECOV           =    30U << 1U | 1U,                    /*!< RECOV error extract code*/
    BESTAT1_UNRECOV         =    31U << 1U | 1U                     /*!< UNRECOV error extract code*/
} stcm_error_code_enum;

/* STCM_BEM */
#define STCM_BEM_PLLUNLK_ERR               0U                        /*!< PLL unlock unrecoverable error mapping bit position */
#define STCM_BEM_MBWDG_ERR                 1U                        /*!< MBIST watchdog unrecoverable error mapping bit position */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BEM_LBWDG_ERR                 2U                        /*!< LBIST watchdog unrecoverable error mapping bit position */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_BEM_ENG_ERR                   3U                        /*!< engine unrecoverable error mapping bit position */
#define STCM_BEM_INVP_ERR                  4U                        /*!< invalid pointer unrecoverable error mapping bit position */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_BEM_BPSEL_ERR                 5U                        /*!< BIST partition selection unrecoverable error mapping bit position */
#define STCM_BEM_INVAITADDR_ERR            6U                        /*!< invalid AIT address unrecoverable error mapping bit position */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
                                           
