sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
#define STCM_RUNBP_TMRDIS                  ((uint32_t)0x00000000U)
#define STCM_RUNBP_TMREN                   STCM_TMRCS_TMR_RUNBP_EN
                                           
#define STCM_UNLOCK_KEY_LOOP0              ((uint8_t)0x00U)
#define STCM_UNLOCK_KEY_LOOP0_KEY0         ((uint32_t)0x8E6B2508U)
#define STCM_UNLOCK_KEY_LOOP0_KEY1         ((uint32_t)0xAC4B130AU)
#define STCM_UNLOCK_KEY_LOOP1              ((uint8_t)0x01U)
#define STCM_UNLOCK_KEY_LOOP1_KEY0         ((uint32_t)0x9F7C3619U)
#define STCM_UNLOCK_KEY_LOOP1_KEY1         ((uint32_t)0xBD5C241BU)
#define STCM_UNLOCK_KEY_LOOP2              ((uint8_t)0x02U)
#define STCM_UNLOCK_KEY_LOOP2_KEY0         ((uint32_t)0xA08D472AU)
#define STCM_UNLOCK_KEY_LOOP2_KEY1         ((uint32_t)0xCE6D352CU)

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define LBISTWDGDIV(regval)                (BITS(20,22) & ((uint32_t)(regval) << 20U))
#define STCM_LBISTWDG_CLKDIV1              LBISTWDGDIV(0)
#define STCM_LBISTWDG_CLKDIV4              LBISTWDGDIV(1)
#define STCM_LBISTWDG_CLKDIV16             LBISTWDGDIV(2)
#define STCM_LBISTWDG_CLKDIV64             LBISTWDGDIV(3)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define MBISTWDGDIV(regval)                (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define STCM_MBISTWDG_CLKDIV1              MBISTWDGDIV(0)
#define STCM_MBISTWDG_CLKDIV4              MBISTWDGDIV(1)
#define STCM_MBISTWDG_CLKDIV16             MBISTWDGDIV(2)
#define STCM_MBISTWDG_CLKDIV64             MBISTWDGDIV(3)

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_AIT_ROM                       ((uint32_t)0x00000000U)
#define STCM_AIT_RAM                       STCM_CFG0_AOSEL

#define AITCLKDIV(regval)                  (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define STCM_AITCLK_DIV1                   AITCLKDIV(0)
#define STCM_AITCLK_DIV2                   AITCLKDIV(1)
#define STCM_AITCLK_DIV10                  AITCLKDIV(2)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define STCM_SERIAL_MODE                   ((uint32_t)0x00000000U)
#define STCM_PARALLEL_MODE                 ((uint32_t)0x80000000U)
                                           
#define STCM_END_NOTCOMPLETE               ((uint32_t)0x00000000U)
#define STCM_END_FINISH                    ((uint32_t)0x00000003U)
#define STCM_RESULT_FAILED                 ((uint32_t)0x00000000U)
#define STCM_RESULE_SUCCESSFUL             ((uint32_t)0x00000003U)
                                           
#define STCM_ERROR_RECOVERABLE             ((uint32_t)0x00000000U)
#define STCM_ERROR_UNRECOVERABLE           ((uint32_t)0x00000001U)
                                           
#define STCM_PTR_MBIST0                    ((uint32_t)0x00000000U)
#define STCM_PTR_MBIST1                    ((uint32_t)0x02000000U)
#define STCM_PTR_MBIST2                    ((uint32_t)0x04000000U)
#define STCM_PTR_MBIST3                    ((uint32_t)0x06000000U)
#define STCM_PTR_MBIST4                    ((uint32_t)0x08000000U)
#define STCM_PTR_MBIST5                    ((uint32_t)0x0A000000U)
#define STCM_PTR_MBIST6                    ((uint32_t)0x0C000000U)
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_PTR_MBIST7                    ((uint32_t)0x0E000000U)
#define STCM_PTR_MBIST8                    ((uint32_t)0x10000000U)
#define STCM_PTR_MBIST9                    ((uint32_t)0x12000000U)
#define STCM_PTR_MBIST10                   ((uint32_t)0x14000000U)
#define STCM_PTR_MBIST11                   ((uint32_t)0x16000000U)
#define STCM_PTR_MBIST12                   ((uint32_t)0x18000000U)
#define STCM_PTR_LBIST                     ((uint32_t)0x40000000U)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#define STCM_PTR_NIL                       ((uint32_t)0x7E000000U)

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define SHIFTRATE(regval)                  (BITS(13,15) & ((uint32_t)(regval) << 13U))
#define STCM_LBIST_SHR_FULL                SHIFTRATE(0)
#define STCM_LBIST_SHR_DIV2                SHIFTRATE(1)
#define STCM_LBIST_SHR_DIV3                SHIFTRATE(2)
#define STCM_LBIST_SHR_DIV4                SHIFTRATE(3)
#define STCM_LBIST_SHR_DIV5                SHIFTRATE(4)
#define STCM_LBIST_SHR_DIV6                SHIFTRATE(5)
#define STCM_LBIST_SHR_DIV7                SHIFTRATE(6)
#define STCM_LBIST_SHR_DIV8                SHIFTRATE(7)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define MBIST_ALGO_AVAILABLE_MASK          BITS(0,13)
#define MBIST_ALGO_0                       STCM_MBALGSEL_MBALG0
#define MBIST_ALGO_1                       STCM_MBALGSEL_MBALG1
#define MBIST_ALGO_2                       STCM_MBALGSEL_MBALG2
#define MBIST_ALGO_3                       STCM_MBALGSEL_MBALG3
#define MBIST_ALGO_4                       STCM_MBALGSEL_MBALG4
#define MBIST_ALGO_5                       STCM_MBALGSEL_MBALG5
#define MBIST_ALGO_6                       STCM_MBALGSEL_MBALG6
#define MBIST_ALGO_7                       STCM_MBALGSEL_MBALG7
#define MBIST_ALGO_8                       STCM_MBALGSEL_MBALG8
#define MBIST_ALGO_9                       STCM_MBALGSEL_MBALG9
#define MBIST_ALGO_10                      STCM_MBALGSEL_MBALG10
#define MBIST_ALGO_11                      STCM_MBALGSEL_MBALG11
#define MBIST_ALGO_12                      STCM_MBALGSEL_MBALG12
#define MBIST_ALGO_13                      STCM_MBALGSEL_MBALG13
                                           
/* port control value definitions */       
#define MBLAUNCH(regval)                   (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define STCM_MBLAUNCH_NOP                  MBLAUNCH(0)
#define STCM_MBLAUNCH_RUNONLY              MBLAUNCH(1)
#define STCM_MBLAUNCH_PROGONLY             MBLAUNCH(4)
#define STCM_MBLAUNCH_RUN_PROG             MBLAUNCH(5)
                                           
#define STCM_MBIST_DIS                     ((uint32_t)0x00000000U)
#define STCM_MBIST_EN                      STCM_MBXPCFG_MBEN
                                           
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_MBIST_MAX_NUM                 12U
#else
#define STCM_MBIST_MAX_NUM                 6U
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define STCM_LBIST_SHIFTCLK_STEP_MAX       8U
#define STCM_LBIST_SHIFTCLK_STEP_MIN       1U
                                           
