sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
#define STCM_LBIST_ENG_TIMESTRAP_MAX       0xFFU
                                           
#define STCM_LBIST_AIT_PACKET_NUM_0        0U
#define STCM_LBIST_AIT_PACKET_NUM_1        1U
#define STCM_LBIST_AIT_PACKET_NUM_2        2U
#define STCM_LBIST_AIT_PACKET_NUM_3        3U
#define STCM_LBIST_AIT_PACKET_NUM_MAX      4U
#define STCM_LBIST_AIT_PACKET_BYTES        384U

/* port control value definitions */       
#define AIT_PACKET_ADDR(packet_index)      (STCM_CFG1_LBAITPADDR & (((uint32_t)(packet_index) * STCM_LBIST_AIT_PACKET_BYTES) << 21U))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#ifdef FW_DEBUG_ERR_REPORT
#define NOT_UNLOCK_KEY_LOOP_INDEX(key_loop_index)         ((key_loop_index) > STCM_UNLOCK_KEY_LOOP2 )

#define NOT_BIST_PLL_ENABLE_CFG(bistpllen)                (((bistpllen) != (uint32_t)DISABLE) && ((bistpllen) != (uint32_t)ENABLE))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_BIST_FIRST_PTR(ptr)                           (((ptr) != STCM_PTR_MBIST0) && ((ptr)  != STCM_PTR_MBIST1)  && ((ptr)  != STCM_PTR_MBIST2)  && \
                                                           ((ptr) != STCM_PTR_MBIST3) && ((ptr)  != STCM_PTR_MBIST4)  && ((ptr)  != STCM_PTR_MBIST5)  && \
                                                           ((ptr) != STCM_PTR_MBIST6) && ((ptr)  != STCM_PTR_MBIST7)  && ((ptr)  != STCM_PTR_MBIST8)  && \
                                                           ((ptr) != STCM_PTR_MBIST9) && ((ptr)  != STCM_PTR_MBIST10) && ((ptr)  != STCM_PTR_MBIST11) && \
                                                           ((ptr) != STCM_PTR_MBIST12) && ((ptr) != STCM_PTR_LBIST)   && ((ptr)  != STCM_PTR_NIL))
#else
#define NOT_BIST_FIRST_PTR(ptr)                           (((ptr) != STCM_PTR_MBIST0) && ((ptr)  != STCM_PTR_MBIST1)  && ((ptr)  != STCM_PTR_MBIST2)  && \
                                                           ((ptr) != STCM_PTR_MBIST3) && ((ptr)  != STCM_PTR_MBIST4)  && ((ptr)  != STCM_PTR_MBIST5)  && \
                                                           ((ptr) != STCM_PTR_MBIST6) && ((ptr)  != STCM_PTR_NIL))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_BIST_GENERAL_ERROR_CODE(general_err_code)     (((general_err_code) != STCM_BEM_PLLUNLK_ERR) && ((general_err_code) != STCM_BEM_MBWDG_ERR) && \
                                                           ((general_err_code) != STCM_BEM_LBWDG_ERR)   && ((general_err_code) != STCM_BEM_ENG_ERR)   && \
                                                           ((general_err_code) != STCM_BEM_INVP_ERR)    && ((general_err_code) != STCM_BEM_BPSEL_ERR) && \
                                                           ((general_err_code) != STCM_BEM_INVAITADDR_ERR))
#else
#define NOT_BIST_GENERAL_ERROR_CODE(general_err_code)     (((general_err_code) != STCM_BEM_PLLUNLK_ERR) && ((general_err_code) != STCM_BEM_MBWDG_ERR) && \
                                                           ((general_err_code) != STCM_BEM_ENG_ERR)     && ((general_err_code) != STCM_BEM_INVP_ERR)   )
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#define NOT_MBIST_EXECUTION_MODE(spm)                     (((spm) != STCM_SERIAL_MODE) && ((spm) != STCM_PARALLEL_MODE))

#define NOT_ERROR_MAPPING_CFG(unrecoverable)              (((unrecoverable) != STCM_ERROR_RECOVERABLE) && ((unrecoverable) != STCM_ERROR_UNRECOVERABLE))

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_MBIST_NEXT_PTR(nextptr)                       (((nextptr) != STCM_PTR_MBIST0)  && ((nextptr) != STCM_PTR_MBIST1)  && ((nextptr) != STCM_PTR_MBIST2)  && \
                                                           ((nextptr) != STCM_PTR_MBIST3)  && ((nextptr) != STCM_PTR_MBIST4)  && ((nextptr) != STCM_PTR_MBIST5)  && \
                                                           ((nextptr) != STCM_PTR_MBIST6)  && ((nextptr) != STCM_PTR_MBIST7)  && ((nextptr) != STCM_PTR_MBIST8)  && \
                                                           ((nextptr) != STCM_PTR_MBIST9)  && ((nextptr) != STCM_PTR_MBIST10) && ((nextptr) != STCM_PTR_MBIST11) && \
                                                           ((nextptr) != STCM_PTR_MBIST12) && ((nextptr) != STCM_PTR_LBIST)   && ((nextptr) != STCM_PTR_NIL))
#else
#define NOT_MBIST_NEXT_PTR(nextptr)                       (((nextptr) != STCM_PTR_MBIST0)  && ((nextptr) != STCM_PTR_MBIST1)  && ((nextptr) != STCM_PTR_MBIST2)  && \
                                                           ((nextptr) != STCM_PTR_MBIST3)  && ((nextptr) != STCM_PTR_MBIST4)  && ((nextptr) != STCM_PTR_MBIST5)  && \
                                                           ((nextptr) != STCM_PTR_MBIST6)  && ((nextptr) != STCM_PTR_NIL))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
                                                           
#define NOT_MBIST_ENABLE_CFG(mben)                        (((mben) != STCM_MBIST_DIS) && ((mben) != STCM_MBIST_EN))
                                                          
#define NOT_MBIST_WDG_CLKDIV(clkdiv)                      (((clkdiv) != STCM_MBISTWDG_CLKDIV1)  && ((clkdiv) != STCM_MBISTWDG_CLKDIV4) && \
                                                           ((clkdiv) != STCM_MBISTWDG_CLKDIV16) && ((clkdiv) != STCM_MBISTWDG_CLKDIV64) )
                                                           
#define NOT_MBIST_LAUNCH_CFG(launch)                      (((launch) != STCM_MBLAUNCH_NOP)      && ((launch) != STCM_MBLAUNCH_RUNONLY) && \
                                                           ((launch) != STCM_MBLAUNCH_PROGONLY) && ((launch) != STCM_MBLAUNCH_RUN_PROG) )
                                                           
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_LBIST_EXECUTION_MODE(spm)                     (((spm) != STCM_SERIAL_MODE) && ((spm) != STCM_PARALLEL_MODE))
#define NOT_LBIST_NEXT_PTR(nextptr)                       (((nextptr) != STCM_PTR_MBIST0)  && ((nextptr) != STCM_PTR_MBIST1)  && ((nextptr) != STCM_PTR_MBIST2)  && \
                                                           ((nextptr) != STCM_PTR_MBIST3)  && ((nextptr) != STCM_PTR_MBIST4)  && ((nextptr) != STCM_PTR_MBIST5)  && \
                                                           ((nextptr) != STCM_PTR_MBIST6)  && ((nextptr) != STCM_PTR_MBIST7)  && ((nextptr) != STCM_PTR_MBIST8)  && \
                                                           ((nextptr) != STCM_PTR_MBIST9)  && ((nextptr) != STCM_PTR_MBIST10) && ((nextptr) != STCM_PTR_MBIST11) && \
                                                           ((nextptr) != STCM_PTR_MBIST12) && ((nextptr) != STCM_PTR_NIL))
                                                           
#define NOT_LBIST_SHIFT_RATE(shr)                         (((shr) != STCM_LBIST_SHR_FULL) && ((shr) != STCM_LBIST_SHR_DIV2) && ((shr) != STCM_LBIST_SHR_DIV3) && \
                                                           ((shr) != STCM_LBIST_SHR_DIV4) && ((shr) != STCM_LBIST_SHR_DIV5) && ((shr) != STCM_LBIST_SHR_DIV6) && \
                                                           ((shr) != STCM_LBIST_SHR_DIV7) && ((shr) != STCM_LBIST_SHR_DIV8))
                                                           
#define NOT_LBIST_DATA_SOURCE(datasource)                 (((datasource) != STCM_AIT_ROM) && ((datasource) != STCM_AIT_RAM))

#define NOT_LBIST_CLKDIV(clkdiv)                          (((clkdiv) != STCM_AITCLK_DIV1) && ((clkdiv) != STCM_AITCLK_DIV2) && ((clkdiv) != STCM_AITCLK_DIV10))

