sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.h
#define NOT_LBIST_WDG_CLKDIV(clkdiv)                      (((clkdiv) != STCM_LBISTWDG_CLKDIV1)  && ((clkdiv) != STCM_LBISTWDG_CLKDIV4) && \
                                                           ((clkdiv) != STCM_LBISTWDG_CLKDIV16) && ((clkdiv) != STCM_LBISTWDG_CLKDIV64))
                                                           
#define NOT_LBIST_SHIFTCLK_STEP_SIZE(stepsize)            (((stepsize) > STCM_LBIST_SHIFTCLK_STEP_MAX) || ((stepsize) < STCM_LBIST_SHIFTCLK_STEP_MIN))

#define NOT_LBIST_SHIFTCLK_START_EN(starten)              (((starten) != (uint32_t)DISABLE) && ((starten) != (uint32_t)ENABLE))

#define NOT_LBIST_SHIFTCLK_END_EN(enden)                  (((enden) != (uint32_t)DISABLE) && ((enden) != (uint32_t)ENABLE))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#endif

/* function declarations */
/* reset STCM register */
void stcm_deinit(void);
/* unlock STCM config registers */
void stcm_unlock(uint8_t key_loop_index);
/* STCM write access enable */
void stcm_writeacess_enable(void);
/* STCM write access disable */
void stcm_writeacess_disable(void);
/* TMR (Triple-Modular Redundancy) run BIST phase enable */
void stcm_tmr_enable(void);
/* TMR (Triple-Modular Redundancy) run BIST phase disable */
void stcm_tmr_disable(void);
/* BIST executed with PLL enabled */
void stcm_bist_with_pll(uint32_t mbistpllen, uint32_t lbistpllen);
/* first BIST select */
void stcm_firstbist(uint32_t ptr);
/* BIST general error mapping */
void stcm_general_bist_error_mapping(uint32_t general_err_code, uint32_t unrecoverable);
/* BIST phase interval config */
void stcm_bist_phase_intvl_cfg(uint32_t interval);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* LBIST AIT packet interval config */
void stcm_lbist_ait_packet_intvl_cfg (uint32_t interval);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* MBIST config */
void stcm_mbist_config(uint32_t mbistnum, uint32_t spm, uint32_t nextptr, uint32_t mben);
/* MBIST partition error mapping */
void stcm_mbist_errormapping(uint32_t mbistnum, uint32_t unrecoverable);
/* MBIST watchdog config */
void stcm_mbist_wdg_config(uint32_t counter, uint32_t clkdiv);
/* get MBIST partition status */
stcm_bist_state stcm_mbist_stat_get(uint32_t mbistnum);
/* MBIST launch config */
void stcm_mbist_launch_config(uint32_t launch);
/* MBIST algorithm selection */
void stcm_mbist_algosel(uint32_t algo);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* LBIST config */
void stcm_lbist_config(uint32_t spm, uint32_t nextptr, uint32_t shr, uint32_t datasource, uint32_t clkdiv);
/* LBIST partition error mapping */
void stcm_lbist_errormapping(uint32_t unrecoverable);
/* LBIST watchdog config */
void stcm_lbist_wdg_config(uint32_t counter, uint32_t clkdiv);
/* get LBIST partition status */
stcm_bist_state stcm_lbist_stat_get(void);
/* LBIST shift clock config */
void stcm_lbist_shiftclk_config(uint32_t stepsize, uint32_t starten, uint32_t enden);
/* LBIST engine timeout strap config */
void stcm_lbist_engine_timestrap_config (uint32_t timestrap);
/* LBIST packet config */
void stcm_lbist_packet_config(uint8_t first_ait_packet_index, uint8_t ait_packet_num);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
/* BIST start */
void stcm_bist_start(void);
/* get TMR state */
stcm_tmr_state stcm_tmr_stat_get(void);
/* get BIST error state */
FlagStatus stcm_bist_err_stat_get(stcm_error_code_enum error_code);
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/* get the timeout or failed LBIST AIT information */
void stcm_failed_timeout_lbist_ait_info_get(uint16_t *packet_addr,uint8_t *ait_stat);
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
#endif /* GD32A7XX_STCM_H */
